In [122]:
Which method in pandas.tools.plotting is used to create scatter plot matrix?

Scatter_matrix

Object `matrix` not found.

NameError: name 'Scatter_matrix' is not defined

In [ ]:
Which method in pandas.tools.plotting is used to create scatter plot matrix

In [2]:
Df_filtered = Df[Df['Column'] == Value]

NameError: name 'Df' is not defined

In [ ]:
If you only want to read the first 999,999 (non-header) rows:

read_csv(..., nrows=999999)
If you only want to read rows 1,000,000 ... 1,999,999

read_csv(..., skiprows=1000000, nrows=999999)

In [2]:
import pandas as pd
df=pd.read_csv('C:\\Users\\Dell-pc\\Desktop\\Data science ML DL Python\\Practice\\Dataset\\song\\songs.csv')

df.head()

,2001,49.94357,21.47114,73.07750,8.74861,-17.40628,-13.09905,-25.01202,-12.23257,7.83089,...,13.01620,-54.40548,58.99367,15.37344,1.11144,-23.08793,68.40795,-1.82223,-27.46348,2.26327
0,2001,48.73215,18.42930,70.32679,12.94636,-10.32437,-24.83777,8.76630,-0.92019,18.76548,...,5.66812,-19.68073,33.04964,42.87836,-9.90378,-32.22788,70.49388,12.04941,58.43453,26.92061
1,2001,50.95714,31.85602,55.81851,13.41693,-6.57898,-18.54940,-3.27872,-2.35035,16.07017,...,3.03800,26.05866,-50.92779,10.93792,-0.07568,43.20130,-115.00698,-0.05859,39.67068,-0.66345
2,2001,48.24750,-1.89837,36.29772,2.58776,0.97170,-26.21683,5.05097,-10.34124,3.55005,...,34.57337,-171.70734,-16.96705,-46.67617,-12.51516,82.58061,-72.08993,9.90558,199.62971,18.85382
3,2001,50.97020,42.20998,67.09964,8.46791,-15.85279,-16.81409,-12.48207,-9.37636,12.63699,...,9.92661,-55.95724,64.92712,-17.72522,-1.49237,-7.50035,51.76631,7.88713,55.66926,28.74903
4,2001,50.54767,0.31568,92.35066,22.38696,-25.51870,-19.04928,20.67345,-5.19943,3.63566,...,6.59753,-50.69577,26.02574,18.94430,-0.33730,6.09352,35.18381,5.00283,-11.02257,0.02263

In [1]:
import pandas as pd
#create empty dataframe
c = ['name','salary']
df = pd.DataFrame( columns=c)
df['name']=['jhon snow','jhon snow','nic cage','jony dep']
df['salary']=[100000,20000,111111,222222]
df['salary2']=[1000001,200002,1111111,22112222]

columns1 = ['name','dep']
df1 = pd.DataFrame( columns=columns1)
df1['name']=['jhon snow','jhon snow','nic cage','jony dep']
df1['dep']=['a','b','c','o']

In [2]:
df['name'] = df['name'].str.split(" ", expand=True)
df.head()
df1['name'] = df1['name'].str.split(" ", expand=True)
df1.head()

   name dep
0  jhon   a
1  jhon   b
2   nic   c
3  jony   o

In [3]:
df.groupby('name')['salary'].value_counts()

name  salary
jhon  20000     1
      100000    1
jony  222222    1
nic   111111    1
Name: salary, dtype: int64

In [7]:
df.groupby('name')['salary'].sum()

name
jhon    120000
jony    222222
nic     111111
Name: salary, dtype: int64

In [6]:
min(sorted(df.groupby('name')['salary'].min()))

20000

In [8]:
df[df['salary'] == min(sorted(df.groupby('name')['salary'].min()))]['name']

1    jhon
Name: name, dtype: object

In [14]:
df = df.sort_values(by=['salary'])
df

   name  salary   salary2
1  jhon   20000    200002
0  jhon  100000   1000001
2   nic  111111   1111111
3  jony  222222  22112222

In [19]:
df.applymap(lambda s: 100 * s)
df

   name  salary   salary2
1  jhon   20000    200002
0  jhon  100000   1000001
2   nic  111111   1111111
3  jony  222222  22112222

In [32]:
df["salary"].map(lambda s: s+90000)

TypeError: map() must have at least two arguments.

In [44]:
df['salary']=df['salary'].map(lambda s: s+90000)
df['salary']

1    1730000
0    1810000
2    1821111
3    1932222
Name: salary, dtype: int64

In [47]:
df[["salary","salary2"]].apply(sum,axis=0)

salary      7293333
salary2    24423336
dtype: int64

In [12]:
#Map: It iterates over each element of a series. 
df[â€˜column1â€™].map(lambda x: 10+x), this will add 10 to each element of column1.
df[â€˜column2â€™].map(lambda x: â€˜AVâ€™+x), this will concatenate â€œAVâ€œ at the beginning of each element of column2 (column format is string).

#Apply: As the name suggests, applies a function along any axis of the DataFrame.
df[[â€˜column1â€™,â€™column2â€™]].apply(sum), it will returns the sum of all the values of column1 and column2.

#ApplyMap: This helps to apply a function to each element of dataframe.
func = lambda x: x+2

SyntaxError: invalid character in identifier (<ipython-input-12-2c3cf2e1cd82>, line 2)

In [36]:
#merge
df

   name  salary   salary2
0  jhon  100000   1000001
1  jhon   20000    200002
2   nic  111111   1111111
3  jony  222222  22112222

In [48]:
pd.merge(df, df1,  how='inner', left_on=['name'], right_on = ['name'])

   name   salary   salary2 dep
0  jhon  1730000    200002   a
1  jhon  1730000    200002   b
2  jhon  1810000   1000001   a
3  jhon  1810000   1000001   b
4   nic  1821111   1111111   c
5  jony  1932222  22112222   o

In [49]:
df_new = pd.concat([df, df1])
df_new

   dep  name     salary     salary2
1  NaN  jhon  1730000.0    200002.0
0  NaN  jhon  1810000.0   1000001.0
2  NaN   nic  1821111.0   1111111.0
3  NaN  jony  1932222.0  22112222.0
0    a  jhon        NaN         NaN
1    b  jhon        NaN         NaN
2    c   nic        NaN         NaN
3    o  jony        NaN         NaN

In [64]:
#Drop the missing values.
#@##We can use Panda's dropna().

df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

   name  salary   salary2
0  jhon  100000   1000001
1  jhon   20000    200002
2   nic  111111   1111111
3  jony  222222  22112222

In [67]:
# The mean
df["salary"].fillna(value=29.69).head(10)

0    100000
1     20000
2    111111
3    222222
Name: salary, dtype: int64

In [55]:
df['xyz']=['ankit.srivastava','ank.sri','wert.dfgh','rtyu.asdf']
df[['1','2']]=df['xyz'].str.split('.',expand=True)
df

   name   salary   salary2               xyz      1           2
1  jhon  1730000    200002  ankit.srivastava  ankit  srivastava
0  jhon  1810000   1000001           ank.sri    ank         sri
2   nic  1821111   1111111         wert.dfgh   wert        dfgh
3  jony  1932222  22112222         rtyu.asdf   rtyu        asdf

SELECT Column1, Column2, mean(Column3), sum(Column4)
FROM SomeTable
GROUP BY Column1, Column2

In [59]:
import numpy as np
df.groupby(['name']).agg({'salary':np.mean,'salary2':np.sum})

       salary   salary2
name
jhon  1770000   1200003
jony  1932222  22112222
nic   1821111   1111111

In [ ]:
SELECT sex, count(*)
FROM tips
GROUP BY sex;

In [3]:
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'
import pandas as pd
tips = pd.read_csv(url)

tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [62]:
tips.groupby('sex').size()

NameError: name 'tips' is not defined

In [ ]:
SELECT day, AVG(tip), COUNT(*)
FROM tips
GROUP BY day;

In [61]:
import numpy as np
a=tips.groupby('day').agg({'tip': np.mean, 'day': np.size})
a

NameError: name 'tips' is not defined

In [ ]:
a[a['tip']==]

In [ ]:
#Top N rows per groupÂ¶
-- Oracle's ROW_NUMBER() analytic function
SELECT * FROM (
  SELECT
    t.*,
    ROW_NUMBER() OVER(PARTITION BY day ORDER BY total_bill DESC) AS rn
  FROM tips t
)
WHERE rn < 3
ORDER BY day, rn;

In [11]:
a=tips.groupby('day')
for i,g in a:
    print(g.sort_values('total_bill',ascending=False).head(1))

    total_bill   tip   sex smoker  day    time  size
95       40.17  4.73  Male    Yes  Fri  Dinner     4
     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3
     total_bill  tip   sex smoker  day    time  size
156       48.17  5.0  Male     No  Sun  Dinner     6
     total_bill  tip     sex smoker   day   time  size
197       43.11  5.0  Female    Yes  Thur  Lunch     4

In [63]:
from pandas import DataFrame
import numpy as np
a = DataFrame([{'var1': 'a,b,c', 'var2': 1},
               {'var1': 'd,e,f', 'var2': 2}])
b = DataFrame([{'var1': 'a', 'var2': 1},
               {'var1': 'b', 'var2': 1},
               {'var1': 'c', 'var2': 1},
               {'var1': 'd', 'var2': 2},
               {'var1': 'e', 'var2': 2},
               {'var1': 'f', 'var2': 2}])
a

    var1  var2
0  a,b,c     1
1  d,e,f     2

In [84]:
s=a["var1"].str.split(',', expand=True).stack()
print(s)
i = s.index.get_level_values(0)
print(i)
df2 = a.loc[i].copy()
df2["var1"] = s.values
df2

0  0    a
   1    b
   2    c
1  0    d
   1    e
   2    f
dtype: object
Int64Index([0, 0, 0, 1, 1, 1], dtype='int64')

  var1  var2
0    a     1
0    b     1
0    c     1
1    d     2
1    e     2
1    f     2

In [ ]:
# sql comparision

In [3]:
import pandas as pd
import numpy as np
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'

tips = pd.read_csv(url)

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [27]:
tips.sort_values('tip').tail(15)

     total_bill    tip     sex smoker   day    time  size
211       25.89   5.16    Male    Yes   Sat  Dinner     4
85        34.83   5.17  Female     No  Thur   Lunch     4
52        34.81   5.20  Female     No   Sun  Dinner     4
44        30.40   5.60    Male     No   Sun  Dinner     4
181       23.33   5.65    Male    Yes   Sun  Dinner     2
88        24.71   5.85    Male     No  Thur   Lunch     2
239       29.03   5.92    Male     No   Sat  Dinner     3
47        32.40   6.00    Male     No   Sun  Dinner     4
183       23.17   6.50    Male    Yes   Sun  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
141       34.30   6.70    Male     No  Thur   Lunch     6
59        48.27   6.73    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

In [26]:
tips.nlargest(10+5, columns='tip').tail(10)

     total_bill   tip     sex smoker   day    time  size
183       23.17  6.50    Male    Yes   Sun  Dinner     4
214       28.17  6.50  Female    Yes   Sat  Dinner     3
47        32.40  6.00    Male     No   Sun  Dinner     4
239       29.03  5.92    Male     No   Sat  Dinner     3
88        24.71  5.85    Male     No  Thur   Lunch     2
181       23.33  5.65    Male    Yes   Sun  Dinner     2
44        30.40  5.60    Male     No   Sun  Dinner     4
52        34.81  5.20  Female     No   Sun  Dinner     4
85        34.83  5.17  Female     No  Thur   Lunch     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4

In [28]:
tips.loc[tips['tip'] < 2, 'tip'] *= 2
# multiply each tip by n where tip is less than m

tips.loc[tips[column1]<m,column2]*=n

In [29]:
DELETE
DELETE FROM tips
WHERE tip > 9;
#In pandas we select the rows that should remain, instead of deleting them

SyntaxError: invalid syntax (<ipython-input-29-ff6cd74b6367>, line 2)

In [ ]:
tips = tips.loc[tips['tip'] <= 9]

In [ ]:
loc will give index 
get all rows where condition satisfy 
equivalent to delete rows

In [32]:
a=tips.groupby('sex')

In [38]:
for i,gr in  a:
    print(gr.sort_values('tip').tail(5)[['total_bill'  , 'tip']])

     total_bill   tip
73        25.28  5.00
155       29.85  5.14
85        34.83  5.17
52        34.81  5.20
214       28.17  6.50
     total_bill    tip
141       34.30   6.70
59        48.27   6.73
23        39.42   7.58
212       48.33   9.00
170       50.81  10.00

In [40]:
a=tips.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]})

              tip
             size      mean
smoker day
No     Fri    4.0  3.187500
       Sat   45.0  3.361556
       Sun   57.0  3.386491
       Thur  45.0  3.122667
Yes    Fri   15.0  3.114000
       Sat   42.0  3.213571
       Sun   19.0  3.595789
       Thur  17.0  3.030000

In [64]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])

In [66]:
s2

0    a_b_c
1    c_d_e
2      NaN
3    f_g_h
dtype: object

In [77]:
pattern = r'[0-9]*[a-z]'

pd.Series(['1!!a', '2', '3a', '3b', '03c']).str.contains(pattern)

0     True
1    False
2     True
3     True
4     True
dtype: bool

In [5]:
import pandas as pd
import numpy as np
#seperate into columns
s = pd.Series(['a', 'a|b', np.nan, 'a|c'])

s.str.get_dummies(sep='|')

   a  b  c
0  1  0  0
1  1  1  0
2  0  0  0
3  1  0  1

In [79]:

import pandas as pd
df=pd.DataFrame()
df['D']=[1,1,1,1,2,2,2,2,3,3,3,3]
df['E']=['A','B','C','D','A','B','C','D','A','B','C','D']
df['F']=[11,12,1,1,22,3,44,5,55,1,1,3]

In [80]:
df.pivot(index='D', columns='E', values='F')

E   A   B   C  D
D
1  11  12   1  1
2  22   3  44  5
3  55   1   1  3

In [81]:
df.pivot(index='E', columns='D', values='F')

D   1   2   3
E
A  11  22  55
B  12   3   1
C   1  44   1
D   1   5   3

In [83]:
 dfg = pd.DataFrame({"A": [1, 1, 2, 3, 2], "B": list("aaaba")})

In [82]:
df = pd.DataFrame({'A' : ['foo.', 'bar', 'foo', 'bar',
   ...:                           'foo', 'bar', 'foo', 'foo'],
   ...:                    'B' : ['one', 'one', 'two', 'three',
   ...:                           'two', 'two', 'one', 'three'],
   ...:                    'C' : np.random.randn(8),
   ...:                    'D' : np.random.randn(8)})

In [114]:
i=df.index
print(i)

i2=range(1,len(i))
i2=sorted(list(i2)+list(i2))
i2
df3=df.loc[i2].copy()
df3.index

RangeIndex(start=0, stop=8, step=1)

Int64Index([1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7], dtype='int64')

In [121]:


a=pd.Series()

type(a)==type(df['D'])

True

In [10]:
c={
  }
c[(222)]=2